Tekla Open API Reference for Tekla Structures 2025
AnalysisConnectivity.ConnectivityEnum Enumeration
 The connectivity types.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ConnectivityEnum
Public Enumeration ConnectivityEnum
Members
Member name | Value | Description
CONNECTIVITY_FIXED | 0 |  The connectivity is fixed.
CONNECTIVITY_FREE | 1 |  The connectivity is free.
CONNECTIVITY_SPRING | 2 |  The connectivity is a spring.
CONNECTIVITY_PARTIAL_RELEASE | 3 |  The connectivity is partially released.
See Also
Reference
Tekla.Structures.Analysis Namespace